In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame({'Col1':[1,2,3,4],
                'Col2':[444,555,666,444],
                'Col3':['abc','def','ghi','xyz']})
df.head()

   Col1  Col2 Col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
 df['Col2'].unique()

array([444, 555, 666], dtype=int64)

In [7]:
df['Col2'].nunique()

3

In [9]:
len(df['Col2'].unique())

3

In [10]:
df['Col2'].value_counts()

Col2
444    2
555    1
666    1
Name: count, dtype: int64

In [12]:
 df[df['Col1']>2]

   Col1  Col2 Col3
2     3   666  ghi
3     4   444  xyz

In [13]:
df['Col1']>2]

0    False
1    False
2     True
3     True
Name: Col1, dtype: bool

In [16]:
 df[(df['Col1']>2) & (df['Col2']==444)]

   Col1  Col2 Col3
3     4   444  xyz

In [17]:
def times2(x):
    return x*2

In [18]:
df['Col1'].sum()

10

In [19]:
df['Col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: Col1, dtype: int64

In [21]:
df['Col3'].apply(len)

0    3
1    3
2    3
3    3
Name: Col3, dtype: int64

In [22]:
df['Col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: Col2, dtype: int64

In [24]:
df.columns

Index(['Col1', 'Col2', 'Col3'], dtype='object')

In [25]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [28]:
df.sort_values(by='Col2')

   Col1  Col2 Col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [29]:
df.isnull()

    Col1   Col2   Col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [30]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
       'D':[1,2,3,4,5,1]}

df = pd.DataFrame(data)

In [31]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  2
2  foo  two  x  3
3  bar  two  y  4
4  bar  one  x  5
5  bar  one  y  1

In [32]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  5.0  1.0
    two  NaN  4.0
foo one  1.0  2.0
    two  3.0  NaN